# AnalyticalMemberForceStartMz Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalMemberForceStartMz Property
ParameterTypeId Class See Also
---
"Start Mz"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalMemberForceStartMz { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalMemberForceStartMz As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalMemberForceStartMz {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace